README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-14 Wed 01:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>yHashCrack: a dictionary based hash cracker</title>
<meta name="author" content="yaspr" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">yHashCrack: a dictionary based hash cracker</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd6ec792">1. Introduction</a></li>
<li><a href="#org40555e1">2. Compilation:</a></li>
<li><a href="#org8f9d41b">3. Testing</a></li>
<li><a href="#org7f3957b">4. How it works</a></li>
<li><a href="#org18d2198">5. To do</a>
<ul>
<li><a href="#orga3824a9">5.1. Example</a>
<ul>
<li><a href="#org1d57d44">5.1.1. Unrolling</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<pre class="example" id="org7165f6e">
             __            
|_| _  _ |_ /   __ _  _ |  
| |(_|_&gt; | |\__ | (_|(_ |&lt;

</pre>

<div id="outline-container-orgd6ec792" class="outline-2">
<h2 id="orgd6ec792"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Dictionany based hash cracker destined to be optimized.
</p>
</div>
</div>

<div id="outline-container-org40555e1" class="outline-2">
<h2 id="org40555e1"><span class="section-number-2">2.</span> Compilation:</h2>
<div class="outline-text-2" id="text-2">
<pre class="example" id="org1532e4b">

.
├── dictionary
│   └── passwords.txt
├── GPLv3.txt
├── hashcrack.c
├── Makefile
├── README.html
├── README.org
└── yhash
    ├── common.c
    ├── common.h
    ├── GPLv3.txt
    ├── libyhash.so
    ├── Makefile
    ├── md5hash
    ├── md5hash.c
    ├── md5main.c
    ├── README.html
    ├── README.org
    ├── sha1hash
    ├── sha1hash.c
    ├── sha1main.c
    ├── sha224hash
    ├── sha224hash.c
    ├── sha224main.c
    ├── sha256hash
    ├── sha256hash.c
    ├── sha256main.c
    ├── sha512hash
    ├── sha512hash.c
    ├── sha512main.c
    └── yhash.h

</pre>

<ol class="org-ol">
<li>Clone the yhash library git repo in the hashcrack directory</li>
</ol>

<div class="org-src-container">
<pre class="src src-sh">
$ git clone https://github.com/yaspr/yhash.git

</pre>
</div>

<ol class="org-ol">
<li>Compile the yhash library</li>
</ol>

<div class="org-src-container">
<pre class="src src-sh">
$ cd yhash
$ make
$ cd ..

</pre>
</div>

<ol class="org-ol">
<li>Compile hashcrack</li>
</ol>

<div class="org-src-container">
<pre class="src src-sh">
$ make

</pre>
</div>
</div>
</div>

<div id="outline-container-org8f9d41b" class="outline-2">
<h2 id="org8f9d41b"><span class="section-number-2">3.</span> Testing</h2>
<div class="outline-text-2" id="text-3">
<p>
The makefile contains a set of basic tests. The following are exmaples of how tests can be run (with <b>NT</b> being the number of threads):
</p>

<div class="org-src-container">
<pre class="src src-sh">
$ make run_md5 <span style="color: #a0522d;">NT</span>=1
$ make run_sha1 <span style="color: #a0522d;">NT</span>=2 
$ make run_dead256 <span style="color: #a0522d;">NT</span>=4
$ make run_dead512 <span style="color: #a0522d;">NT</span>=4

</pre>
</div>
</div>
</div>

<div id="outline-container-org7f3957b" class="outline-2">
<h2 id="org7f3957b"><span class="section-number-2">4.</span> How it works</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Loads the dictionary</li>

<li>If single threaded, go through all dictionary entries and compare the entry's hash with the target hash.
If multi-threaded, assign to each thread its block of dictionary entries.
Each thread goes through all of its entries and compares their hashes with the target hash.</li>

<li>If the hash is found, the tool prints <b>CRACKED</b> in green on stdout. If the hash is not found, the tool prints
<b>FAILED</b> in red on stdout.</li>
</ol>
</div>
</div>

<div id="outline-container-org18d2198" class="outline-2">
<h2 id="org18d2198"><span class="section-number-2">5.</span> To do</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Optimize yhash (obviously!).</li>

<li>Optimize by vectorizing the comparison between the calculated hash and the target hash.</li>
</ol>
</div>

<div id="outline-container-orga3824a9" class="outline-3">
<h3 id="orga3824a9"><span class="section-number-3">5.1.</span> Example</h3>
<div class="outline-text-3" id="text-5-1">
<p>
For MD5, the output hash is 128bits (16 bytes). On an x86 CPU with SSE, the whole hash can be stored
in one XMM register. Therefore, comparing two hashes is a simple 128-bit xor.
</p>

<div class="org-src-container">
<pre class="src src-c">
xmm0 = target_MD5_hash;
xmm1 = { 1 };

<span style="color: #a020f0;">while</span> (i &lt; nb_words &amp;&amp; xmm1)
{
     xmm2 = md5hash(words_list[i++]);
     xmm1 = xmm0 XOR xmm2;
}

</pre>
</div>

<p>
For SHA1, SHA224 &amp; SHA256 the output hash can be stored in two XMM registers using SSE, or one YMM register
on a CPU with the AVX instruction set.
</p>

<div class="org-src-container">
<pre class="src src-c">
ymm0 = target_SHA?_hash;
ymm1 = { 1 };

<span style="color: #a020f0;">while</span> (i &lt; nb_words &amp;&amp; ymm1)
{
     ymm2 = sha?hash(words_list[i++]);
     ymm1 = ymm0 XOR ymm2;
}

</pre>
</div>

<p>
For SHA512, two YMM registers can be used if AVX is available, or one ZMM register if the CPU supports AVX512.
</p>

<div class="org-src-container">
<pre class="src src-c">
zmm0 = target_SHA512_hash;
zmm1 = { 1 };

<span style="color: #a020f0;">while</span> (i &lt; nb_words &amp;&amp; zmm1)
{
     zmm2 = sha512hash(words_list[i++]);
     zmm1 = zmm0 XOR zmm2; 
}

</pre>
</div>
</div>

<div id="outline-container-org1d57d44" class="outline-4">
<h4 id="org1d57d44"><span class="section-number-4">5.1.1.</span> Unrolling</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
This allows to check multiple entry hashes per iteration.
</p>
</div>

<ol class="org-ol">
<li><a id="org0e1060b"></a>Unroll 2<br />
<div class="outline-text-5" id="text-5-1-1-1">
<div class="org-src-container">
<pre class="src src-c">
xmm0 = target_MD5_hash;
xmm1 = { 1 };
xmm2 = { 1 };

<span style="color: #a020f0;">while</span> (i &lt; nb_words &amp;&amp; xmm1 &amp;&amp; xmm2)
{
     xmm3 = md5hash(words_list[i]);
     xmm4 = md5hash(words_list[i + 1]);

     xmm1 = xmm0 XOR xmm3;
     xmm2 = xmm0 XOR xmm4;
}

</pre>
</div>
</div>
</li>

<li><a id="org45f24a8"></a>Unroll 4<br />
<div class="outline-text-5" id="text-5-1-1-2">
<div class="org-src-container">
<pre class="src src-c">
xmm0 = target_MD5_hash;
xmm1 = { 1 };
xmm2 = { 1 };
xmm3 = { 1 };
xmm4 = { 1 };

<span style="color: #a020f0;">while</span> (i &lt; nb_words &amp;&amp; xmm1 &amp;&amp; xmm2 &amp;&amp; xmm3 &amp;&amp; xmm4)
{
     xmm5 = md5hash(words_list[i]);
     xmm6 = md5hash(words_list[i + 1]);
     xmm7 = md5hash(words_list[i + 2]);
     xmm8 = md5hash(words_list[i + 3]);

     xmm1 = xmm0 XOR xmm5;
     xmm2 = xmm0 XOR xmm6;
     xmm3 = xmm0 XOR xmm7;
     xmm4 = xmm0 XOR xmm8;
}

</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: yaspr</p>
<p class="date">Created: 2022-12-14 Wed 01:33</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
